run/DuanEtAl_clean/twoPhase/0.orig/fluid/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{

  top
  {
      /* type            zeroGradient; */
      type          prghTotalPressure;
      p0            uniform 101325;
      value         uniform 101325;
  }

  fluid_to_heater
  {
      type            fixedFluxPressure;
  }

  side
  {
      /* type            fixedValue;
      value           uniform 101325; */
      type            zeroGradient;
  }
  front
  {
    type wedge;
  }
  back
  {
    type wedge;
  }

  axis
  {
    type empty;
  }
}

// ************************************************************************* //
