run/DuanEtAl_clean/twoPhase/system/fluid/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



U
{
    boundaryField
    {
    side
    {
        //type            zeroGradient;
	    type        pressureInletOutletVelocity;
        value       $internalField;
        // value           uniform (0 0 0);
    }

    top
    {
        //type            zeroGradient;
        type        pressureInletOutletVelocity;
        value       $internalField;
        // value           uniform (0 0 0);
    }

    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }

    axis
    {
        type             symmetry;
    }
    fluid_to_solid
    {
        type            noSlip;
    }
    }
}


p_rgh
{
    boundaryField
    {
    top
    {
        type            totalPressure;
        p0              $internalField;
        // value           $internalField;
        // type            fixedValue;
    }

    side
    {
        type            totalPressure;
        p0              $internalField;
        // value           $internalField;
	    // type            zeroGradient;
    }

    fluid_to_solid
    {
        type            fixedFluxPressure;
    }
    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }

    axis
    {
        type             symmetry;
    } 
    }
}


// ************************************************************************* //
