run/DuanEtAl_clean/twoPhase/system/fluid/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
solvers
{
    alpha.water
    {
        nAlphaCorr      2;
        nAlphaSubCycles 2;
        cAlpha          2;

        MULESCorr       no;
        nLimiterIter    5;

        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
        advectionScheme isoAdvection;
        reconstructionScheme plicRDF; //isoAlpha;
        // vof2IsoTol 1e-5;
        // surfCellTol 1e-5;
        // snapTol     1e-5;
        snapTol 1e-6;
        vof2IsoTol 1e-8;
        surfCellTol 1e-8;
        writeVTK true;
    }

    psiFinal
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-7;
        relTol           0.00;
    }

    rhoCpLFinal
    {
        solver           diagonal;
        preconditioner   DILU;
        tolerance        1e-7;
    }

    rhoCpVFinal
    {
        solver           diagonal;
        preconditioner   DILU;
        tolerance        1e-7;
    }

    rho
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-7;
        relTol          0.1;
    }

    rhoFinal
    {
        $rho;
        tolerance       1e-7;
        relTol          0;
    }

    p_rgh
    {
        solver           GAMG;
        tolerance        1e-7;
        relTol           0.01;
        smoother         DIC;
        minIter 	  3;
        maxIter 	  15;
        nCellsInCoarsestLevel 100;
    }

    p_rghFinal
    {
        $p_rgh;
        tolerance        1e-7;
        relTol           0;
        minIter 	  3;
        maxIter 	  20;
    }

    "(U|h|T.*|k|epsilon|R)"
    {
        solver           smoothSolver; //PBiCGStab;
        smoother         symGaussSeidel;
        //preconditioner   DILU;
        tolerance        1e-7;
        relTol           0.0;
        minIter          5;
        maxIter          50;
    }

    "(U|h|T.*|k|epsilon|R)Final"
    {
        $U;
        tolerance        1e-7;
        relTol           0;
        maxIter          50;
    }

}

PIMPLE
{
    momentumPredictor   yes;
    nCorrectors         4;
    nNonOrthogonalCorrectors 2;
    frozenFlow          false;
}

relaxationFactors
{
    equations
    {
        "h.*"           1;
        "U.*"           1;
    }
}

// ************************************************************************* //