run/DuanEtAl_clean/twoPhase/system/fluid/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/fluid";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "../../simSetup"
defaultFieldValues
(
    volScalarFieldValue alpha.water 1
    volScalarFieldValue p_rgh 101325
    volScalarFieldValue p 101325
);

regions
(
    sphereToCell
    {
        centre (0 $Origin 0);
        radius $Rb0;
        
        fieldValues
        (
            // volScalarFieldValue T 373.15
            // volScalarFieldValue T.air 373.15
            volScalarFieldValue alpha.water 0
            volScalarFieldValue p_rgh 101325
            volScalarFieldValue p 101325
        );
    }
);


// ************************************************************************* //
